{
  "backend/main.mo": "Actor handling membership and free trial form submissions with validation, ID assignment, storage, and retrieval.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Reference file containing short descriptions of multiple frontend pages and components.",
  "frontend/index.css": "Global CSS defining light and dark theme variables using OKLCH values with Tailwind layers.",
  "frontend/index.html": "HTML entry point setting SEO metadata, font preloads, and mounting the React app.",
  "frontend/src/App.tsx": "Main app router configuration with all site routes and a ThemeProvider defaulting to light mode.",
  "frontend/src/components/contact/MapAndContactSection.tsx": "Section displaying an embedded Google Map and contact details styled with cards and icons.",
  "frontend/src/components/contact/QuickContactActions.tsx": "Floating quick‑contact widget offering WhatsApp and phone actions with tooltips and hide control.",
  "frontend/src/components/forms/FreeTrialBookingForm.tsx": "Form component for booking a free trial session, handling validation and submission via a mutation hook with success UI states.",
  "frontend/src/components/forms/OnlineMembershipForm.tsx": "Form component for submitting online membership applications with validation, mutation-based submission, and success feedback.",
  "frontend/src/components/gallery/BeforeAfterPair.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Displays a grid of images with a lightbox modal, supporting navigation between images.",
  "frontend/src/components/home/AboutSection.tsx": "Renders an About section highlighting gym features using cards and icon-based descriptions.",
  "frontend/src/components/home/BeforeAfterPreview.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/home/HeroSection.tsx": "Hero banner with background image, marketing text, and navigation buttons for membership and contact.",
  "frontend/src/components/home/MembershipPlansPreview.tsx": "Shows preview cards of membership plans with pricing, features, and CTA buttons to join.",
  "frontend/src/components/home/ProgramsPreview.tsx": "Displays a grid of popular training programs with icons and descriptions, plus a link to view more.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Renders a testimonials grid using cards, avatars, and star ratings for member feedback.",
  "frontend/src/components/home/TrainerPreview.tsx": "Displays a preview of three trainers using TrainerCard and includes navigation to the full trainers page.",
  "frontend/src/components/home/WhyChooseSection.tsx": "Shows a grid of gym advantages with icons, titles, and descriptions.",
  "frontend/src/components/layout/HeaderNav.tsx": "Implements responsive header navigation with desktop links, mobile sheet menu, and a Join Now button.",
  "frontend/src/components/layout/SiteFooter.tsx": "Provides footer with business info, quick links, social icons, and contact details.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with header, footer, main outlet, and quick contact actions.",
  "frontend/src/components/programs/ProgramCard.tsx": "Displays program details with icon, description, benefits list, and buttons for enrollment or contact.",
  "frontend/src/components/trainers/TrainerCard.tsx": "Shows trainer profile card with image, role, specialty, and certification badges.",
  "frontend/src/content/blogPosts.ts": "Defines BlogPost interface and a list of detailed blog posts with HTML content.",
  "frontend/src/content/business.ts": "Exports basic business information like name, contact details, and hours.",
  "frontend/src/content/faq.ts": "Defines the FaqItem interface and exports an array of FAQ questions and answers for the gym site.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user’s Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/usePageMeta.ts": "Custom hook that updates the document title and meta description when pages load.",
  "frontend/src/hooks/useQueries.ts": "Defines mutations for submitting membership and free trial forms via the backend actor and invalidates relevant queries on success.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables defining theme colors and global base styles.",
  "frontend/src/main.tsx": "App entry point that mounts React, wrapping the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, values, and story sections, and sets page metadata.",
  "frontend/src/pages/BlogIndexPage.tsx": "Displays a grid of blog posts with metadata and navigation to individual post pages.",
  "frontend/src/pages/BlogPostPage.tsx": "Renders a single blog post based on the slug, with navigation back and dynamic page metadata.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with meta tags, a free trial booking form, and a map/contact section.",
  "frontend/src/pages/FaqPage.tsx": "Displays FAQ items in an accordion layout with page metadata and contact info.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery of facility images with metadata and a gallery grid component.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage by rendering hero, about, programs, memberships, testimonials, trainers, and contact sections.",
  "frontend/src/pages/MembershipPlansPage.tsx": "Presents membership plans with pricing, features, and an online membership form.",
  "frontend/src/pages/ProgramsPage.tsx": "Lists various fitness programs with icons, descriptions, and benefit details.",
  "frontend/src/pages/TrainersPage.tsx": "Displays trainer profiles using TrainerCard components with page metadata.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugin setup.",
  "project_state.json": "Defines the project’s current website design goals, theme requirements, and architectural notes for a premium gym site. Lists existing implemented features and overall project state metadata."
}